Tekla Open API Reference for Tekla Structures 2025
ProfileName Class
 The ProfileName class contains the name of the profile item.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.ProfileName
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class ProfileName
Public NotInheritable Class ProfileName
The ProfileName type exposes the following members.
Constructors
Name | Description
ProfileName
Initializes a new instance of the ProfileName class
Top
Properties
Name | Description
Name
 The profile item name.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace